#include <CTRPluginFramework.hpp>
#include <string>
#include <vector>
#include <codecvt>
#include <locale>
#include "ACNL/types.h"
#include "ACNL/Game.h"

namespace CTRPluginFramework::ACNL::Game {
  std::vector<ItemInfo> const AllItems {
    { "枯れた竹", "かれたたけ" },
    { "枯れた木", "かれたき" },
    { "木の切り株(成長1)", "きのきりかぶ1" },
    { "木の切り株(成長2)", "きのきりかぶ2" },
    { "木の切り株(成長3)", "きのきりかぶ3" },
    { "木の切り株", "きのきりかぶ4" },
    { "木の切り株(ハート)", "きのきりかぶ(はーと)" },
    { "木の切り株(蝶)", "きのきりかぶ(ちょう)" },
    { "木の切り株(オレンジ)", "きのきりかぶ(おれんじ)" },
    { "木の切り株(イチョウ)", "きのきりかぶ(いちょう)" },
    { "木の切り株(×印)", "きのきりかぶ(×じるし)" },
    { "木の切り株(トライフォース)", "きのきりかぶ(とらいほーす)" },
    { "針葉樹の切り株(成長1)", "しんようじゅのきりかぶ1" },
    { "針葉樹の切り株(成長2)", "しんようじゅのきりかぶ2" },
    { "針葉樹の切り株(成長3)", "しんようじゅのきりかぶ3" },
    { "針葉樹の切り株", "しんようじゅのきりかぶ" },
    { "針葉樹の切り株(星)", "しんようじゅのきりかぶ(ほし)" },
    { "針葉樹の切り株(猫)", "しんようじゅのきりかぶ(ねこ)" },
    { "針葉樹の切り株(花)", "しんようじゅのきりかぶ(はな)" },
    { "針葉樹の切り株(葉っぱ)", "しんようじゅのきりかぶ(はっぱ)" },
    { "針葉樹の切り株(オンプ)", "しんようじゅのきりかぶ(おんぷ)" },
    { "針葉樹の切り株(クローバー)", "しんようじゅのきりかぶ(くろーばー)" },
    { "切断ヤシの木(成長1)", "せつだんやしのき1" },
    { "切断ヤシの木(成長2)", "せつだんやしのき2" },
    { "切断ヤシの木(成長3)", "せつだんやしのき3" },
    { "ヤシの切り株(flag)", "ヤシのきりかぶ" },
    { "切断竹(成長1)", "せつだんたけ1" },
    { "切断竹(成長2)", "せつだんたけ2" },
    { "切断竹(成長3)", "せつだんたけ3" },
    { "木(成長1)", "き1" },
    { "木(成長2)", "き2" },
    { "木(成長3)", "き3" },
    { "木(成長4)", "き4" },
    { "木(flag)", "き" },
    { "針葉樹(成長1)", "しんようじゅ1" },
    { "針葉樹(成長2)", "しんようじゅ2" },
    { "針葉樹(成長3)", "しんようじゅ3" },
    { "針葉樹(成長4)", "しんようじゅ4" },
    { "針葉樹(flag)", "しんようじゅ" },
    { "ヤシの木(成長1)", "やしのき1" },
    { "ヤシの木(成長2)", "やしのき2" },
    { "ヤシの木(成長3)", "やしのき3" },
    { "ヤシの木(成長4)", "やしのき4" },
    { "ヤシの木(flag)", "やしのき" },
    { "バナナの木(成長1)", "ばななのき1" },
    { "バナナの木(成長2)", "ばななのき2" },
    { "バナナの木(成長3)", "ばななのき3" },
    { "バナナの木(成長4)", "ばななのき4" },
    { "バナナの木(flag)", "ばななのき" },
    { "竹(成長1)", "たけ1" },
    { "竹(成長2)", "たけ2" },
    { "竹(成長3)", "たけ3" },
    { "竹", "たけ4" },

    { "リンゴの木(成長1)", "りんごのき1" },
    { "リンゴの木(成長2)", "りんごのき2" },
    { "リンゴの木(成長3)", "りんごのき3" },
    { "リンゴの木(成長4)", "りんごのき4" },
    { "リンゴの木(flag)", "りんごのき" },
    { "オレンジの木(成長1)", "おれんじのき1" },
    { "オレンジの木(成長2)", "おれんじのき2" },
    { "オレンジの木(成長3)", "おれんじのき3" },
    { "オレンジの木(成長4)", "おれんじのき4" },
    { "オレンジの木(flag)", "おれんじのき" },
    { "ナシの木(成長1)", "なしのき1" },
    { "ナシの木(成長2)", "なしのき2" },
    { "ナシの木(成長3)", "なしのき3" },
    { "ナシの木(成長4)", "なしのき4" },
    { "ナシの木(flag)", "なしのき" },
    { "モモの木(成長1)", "モモのき1" },
    { "モモの木(成長2)", "モモのき2" },
    { "モモの木(成長3)", "モモのき3" },
    { "モモの木(成長4)", "モモのき4" },
    { "モモの木(flag)", "モモのき木" },
    { "さくらんぼの木(成長1)", "さくらんぼのき1" },
    { "さくらんぼの木(成長2)", "さくらんぼのき2" },
    { "さくらんぼの木(成長3)", "さくらんぼのき3" },
    { "さくらんぼの木(成長4)", "さくらんぼのき4" },
    { "さくらんぼの木(flag)", "さくらんぼのき" },

    { "ドリアンの木(成長1)", "ドリアンのき1" },
    { "ドリアンの木(成長2)", "ドリアンのき2" },
    { "ドリアンの木(成長3)", "ドリアンのき3" },
    { "ドリアンの木(成長4)", "ドリアンのき4" },
    { "ドリアンの木(flag)", "ドリアンのき" },
    { "レモンの木(成長1)", "レモンのき1" },
    { "レモンの木(成長2)", "レモンのき2" },
    { "レモンの木(成長3)", "レモンのき3" },
    { "レモンの木(成長4)", "レモンのき4" },
    { "レモンの木(flag)", "レモンのき" },
    { "ライチの木(成長1)", "ライチのき1" },
    { "ライチの木(成長2)", "ライチのき2" },
    { "ライチの木(成長3)", "ライチのき3" },
    { "ライチの木(成長4)", "ライチのき4" },
    { "ライチの木(flag)", "ライチのき" },
    { "マンゴーの木(成長1)", "マンゴーのき1" },
    { "マンゴーの木(成長2)", "マンゴーのき2" },
    { "マンゴーの木(成長3)", "マンゴーのき3" },
    { "マンゴーの木(成長4)", "マンゴーのき4" },
    { "マンゴーの木(flag)", "マンゴーのき" },
    { "柿の木(成長1)", "かきのき1" },
    { "柿の木(成長2)", "かきのき2" },
    { "柿の木(成長3)", "かきのき3" },
    { "柿の木(成長4)", "かきのき4" },
    { "柿の木(flag)", "かきのき" },
    { "ベルがなる木(成長1)", "ベルがなるき1" },
    { "ベルがなる木(成長2)", "ベルがなるき2" },
    { "ベルがなる木(成長3)", "ベルがなるき3" },
    { "ベルがなる木(成長4)", "ベルがなるき4" },
    { "ベルがなる木(flag)", "ベルがなるき" },

    { "木(家具)", "き(かぐ)" },
    { "木(ハチの巣)", "き(ハチのす)" },
    { "木(ベル 1)", "き(ベル1)" },
    { "木(ベル 2)", "き(ベル2)" },
    { "木(卵)", "き(たまご)" },
    { "針葉樹(家具)", "しんようじゅ(かぐ)" },
    { "針葉樹(ハチの巣)", "しんようじゅ(ハチのす)" },
    { "針葉樹(ベル 1)", "しんようじゅ(ベル1)" },
    { "針葉樹(ベル 2)", "しんようじゅ(ベル2)" },
    { "針葉樹(卵)", "しんようじゅ(たまご)" },
    { "針葉樹(イルミネーション)", "しんようじゅ(イルミネーション)" },
    { "雑草1", "ざっそう1" },
    { "雑草2", "ざっそう2" },
    { "雑草3", "ざっそう3" },
    { "雑草4", "ざっそう4" },

    { "ヒイラギの低木(成長1)", "ヒイラギのていぼく1" },
    { "ヒイラギの低木(成長2)", "ヒイラギのていぼく2" },
    { "ヒイラギの低木", "ヒイラギのていぼく3" },
    { "ピンクのツツジの低木(成長1)", "ピンクのツツジのていぼく1" },
    { "ピンクのツツジの低木(成長2)", "ピンクのツツジのていぼく2" },
    { "ピンクのツツジの低木", "ピンクのツツジのていぼく3" },
    { "白いツツジの低木(成長1)", "しろいツツジのていぼく1" },
    { "白いツツジの低木(成長2)", "しろいツツジのていぼく2" },
    { "白いツツジの低木", "しろいツツジのていぼく3" },
    { "青いアジサイの低木(成長1)", "あおいアジサイのていぼく1" },
    { "青いアジサイの低木(成長2)", "あおいアジサイのていぼく2" },
    { "青いアジサイの低木", "あおいアジサイのていぼく3" },
    { "ピンクのアジサイの低木(成長1)", "ピンクのアジサイのていぼく1" },
    { "ピンクのアジサイの低木(成長2)", "ピンクのアジサイのていぼく2" },
    { "ピンクのアジサイの低木", "ピンクのアジサイのていぼく3" },
    { "赤いハイビスカスの低木(成長1)", "あかいハイビスカスのていぼく1" },
    { "赤いハイビスカスの低木(成長2)", "あかいハイビスカスのていぼく2" },
    { "赤いハイビスカスの低木", "あかいハイビスカスのていぼく3" },
    { "黄色ハイビスカスの低木(成長1)", "きいろいハイビスカスのていぼく1" },
    { "黄色ハイビスカスの低木(成長2)", "きいろいハイビスカスのていぼく2" },
    { "黄色いハイビスカスの低木", "きいろいハイビスカスのていぼく3" },
    { "キンモクセイの低木(成長1)", "キンモクセイのていぼく1" },
    { "キンモクセイの低木(成長2)", "キンモクセイのていぼく2" },
    { "キンモクセイの低木", "キンモクセイのていぼく3" },

    { "岩1(flag)", "いわ1" },
    { "岩2(flag)", "いわ2" },
    { "岩3(flag)", "いわ3" },
    { "岩4(flag)", "いわ4" },
    { "岩5(flag)", "いわ5" },

    { "マイデザイン", "マイデザイン" },
    { "穴", "あな" }
	};

  std::string replace_to_hiragana(std::string const& str) {
    static std::wstring_convert<std::codecvt_utf8<char16_t>, char16_t> conv;

    auto str16 = conv.from_bytes(str);

    for( auto& c : str16 ) {
      if( c >= 0x3041 && c <= 0x3093 ) {
        c += 0x60;
      }
    }

    return conv.to_bytes(str16);
  }
  
  bool get_item_name(u16 item, ItemInfo& out) {
		if( item >= 0x5 && item <= 0x9E ) {
      item -= 0x5;
			out = { AllItems[item].first, AllItems[item].second };
      return true;
		}

		if( item == 0xCC ) { out = { "クローバー(雑草)", "くろーばー(ざっそう)" }; return true; };
		if( item == 0xCD ) { out = { "ラフレシア", "らふれしあ" }; return true; };
		if( item == 0xF8 ) { out = { "枯れたラフレシア", "かれたらふれしあ" }; return true; };
		if( item == 0xFD ) { out = { "埋められない穴", "うめられないあな" }; return true; };
		
		bool w = false;
		
		if( item >= 0x9F && item <= 0xCB ) {
			item += 0x2890;
		}
		else if( item >= 0xCE && item <= 0xF7 ) {
			w = true;
			item += 0x2861;
		}
		
		if( item >= 0x2000 && item <= 0x372B )
		{
			u32 addr = 0x31724DC0;
			u32 len = 0;

			addr += *(u32*)( addr + 4 + (item - 0x2000) * 4 );
      
			while( *(u16*)(addr + len * 2) != 0 ) {
				len++;
      }
			
			std::string str;
			Process::ReadString(addr, str, len * 2, StringFormat::Utf16);
			std::string isDead = w ? "(枯れた)" : "";

      std::string s = str + std::string(w ? "(枯れた)" : "");
      out = { str, replace_to_hiragana(str) };

      return true;
		}
		
		return false;
	}
}